# Translate Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IATFTranslationServer..::..Translate Method
IATFTranslationServer Interface See Also
---
Translate a model according to translationData settings
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
bool Translate(
	ATFTranslationServiceData serviceData
)
```

Visual Basic
---
```text
Function Translate ( _
	serviceData As ATFTranslationServiceData _
) As Boolean
```

Visual C++
---
```text
bool Translate(
	ATFTranslationServiceData^ serviceData
)
```

# ### Parameters
serviceData
    Type: ATFTranslationServiceData
# ### Return Value
Returns true if the translation finished successfully, false otherwise.
# See Also
IATFTranslationServer Interface
Autodesk.Revit.DB Namespace